Mystfit/ESP32-BLE-CompositeHID/DualSenseGamepadDevice.cpp
#include "DualsenseGamepadDevice.h"
#include "BleCompositeHID.h"
#include "DualsenseDescriptors.h"
#include "ArduinoDefines.h"
#include <cstddef>
#include <cstdint>
#include <functional>
#include <stdint.h>
#include <string.h>
#include "esp_mac.h"
#include "esp_cpu.h"
#if defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#define LOG_TAG "DualsenseGamepadDevice"
#else
#include "esp_bt_device.h"
#include "esp_bt_main.h"
#include "esp_log.h"
#include "esp_log_level.h"

static const char* LOG_TAG = "DualsenseGamepadDevice";
#endif

// The DUALSENSE_BUTTON_* masks live in a 20-bit logical button space. In the wire report the
// low nibble of buttons[0] is occupied by the 4-bit hat, so button bit 0 lands at combined
// bit 4 (= buttons[0] bit 4). These helpers apply the 4-bit shift when reading/writing.
static inline void buttons_set(uint8_t b[3], uint32_t mask)
{
    uint32_t shifted = mask << 4;
    b[0] |= (uint8_t)(shifted & 0xFF);
    b[1] |= (uint8_t)((shifted >> 8) & 0xFF);
    b[2] |= (uint8_t)((shifted >> 16) & 0xFF);
}
static inline void buttons_clear(uint8_t b[3], uint32_t mask)
{
    uint32_t shifted = mask << 4;
    b[0] &= (uint8_t)~(shifted & 0xFF);
    b[1] &= (uint8_t)~((shifted >> 8) & 0xFF);
    b[2] &= (uint8_t)~((shifted >> 16) & 0xFF);
}
static inline bool buttons_test(const uint8_t b[3], uint32_t mask)
{
    uint32_t combined = (uint32_t)b[0] | ((uint32_t)b[1] << 8) | ((uint32_t)b[2] << 16);
    uint32_t shifted = mask << 4;
    return (combined & shifted) == shifted;
}
static inline void hat_set(uint8_t b[3], uint8_t dir)
{
    b[0] = (uint8_t)((b[0] & 0xF0) | (dir & 0x0F));
}
static inline uint8_t hat_get(const uint8_t b[3])
{
    return (uint8_t)(b[0] & 0x0F);
}

DualsenseGamepadCallbacks::DualsenseGamepadCallbacks(DualsenseGamepadDevice* device)
    : _device(device)
{
}

void DualsenseGamepadCallbacks::onWrite(NimBLECharacteristic* pCharacteristic, NimBLEConnInfo& connInfo)
{
    // Get the characteristic handle to identify which characteristic was written
    [[maybe_unused]] uint16_t handle = pCharacteristic->getHandle();

    const NimBLEAttValue& value = pCharacteristic->getValue();
    size_t len = value.size();

    if (len == 0) {
        ESP_LOGD(LOG_TAG, "*** onWrite triggered: handle=%d, size=0 (empty) connHandle=%d ***",
            handle, connInfo.getConnHandle());
        return;
    }

    const uint8_t* data = value.data();
    [[maybe_unused]] const char* role = "unknown";
    if (_device) {
        if (pCharacteristic == _device->getOutputChar())         role = "OUTPUT-0x31";
        else if (pCharacteristic == _device->getCalibration())   role = "FEATURE-0x05";
        else if (pCharacteristic == _device->getPairingInfo())   role = "FEATURE-0x09";
        else if (pCharacteristic == _device->getFirmwareInfo())  role = "FEATURE-0x20";
        else if (pCharacteristic == _device->getBtPatchInfo())   role = "FEATURE-0x22";
    }
    // Full hex dump so we can see exactly what the host is writing - critical
    // for confirming whether tools like DSX are sending output reports at all,
    // and for inspecting reserved regions we don't parse into named fields.
    ESP_LOGD(LOG_TAG, "*** onWrite: role=%s handle=%d size=%d connHandle=%d ***",
        role, handle, len, connInfo.getConnHandle());
    ESP_LOG_BUFFER_HEX_LEVEL(LOG_TAG, data, len, ESP_LOG_DEBUG);

    if (len < 47) {
        ESP_LOGW(LOG_TAG, "Output report too small for DualSense: %d bytes (may be feature/LED-only write)", len);
    }

    DualsenseGamepadOutputReportData outputData;

    if (len >= 47 && outputData.load(data, len)) {
        _device->onReceivedOutputReport.fire(outputData);
    }
}

void DualsenseGamepadCallbacks::onRead(NimBLECharacteristic* pCharacteristic, NimBLEConnInfo& connInfo)
{
    // When Steam/host reads a feature report, we need to populate it with current data
    // The characteristic handle can help identify which report is being read
    [[maybe_unused]] uint16_t handle = pCharacteristic->getHandle();

    ESP_LOGD(LOG_TAG, "*** onRead triggered: handle=%d, connHandle=%d ***", handle, connInfo.getConnHandle());

    // Populate feature reports on read so Steam gets valid data
    // This is called BEFORE the data is sent to the host
    _device->populateFeatureReportOnRead(pCharacteristic);
}

void DualsenseGamepadCallbacks::onSubscribe(NimBLECharacteristic* pCharacteristic, NimBLEConnInfo& connInfo, uint16_t subValue)
{
    [[maybe_unused]] uint16_t handle = pCharacteristic->getHandle();
    [[maybe_unused]] const char* role = "unknown";

    if (_device) {
        if (pCharacteristic == _device->getInputChar())          role = "INPUT-0x31";
        else if (pCharacteristic == _device->getOutputChar())    role = "OUTPUT-0x31";
        else if (pCharacteristic == _device->getMinimalInput())  role = "INPUT-0x01";
        else if (pCharacteristic == _device->getCalibration())   role = "FEATURE-0x05";
        else if (pCharacteristic == _device->getPairingInfo())   role = "FEATURE-0x09";
        else if (pCharacteristic == _device->getFirmwareInfo())  role = "FEATURE-0x20";
        else if (pCharacteristic == _device->getBtPatchInfo())   role = "FEATURE-0x22";
    }

    ESP_LOGI(LOG_TAG, "*** onSubscribe: role=%s handle=%d subValue=%d (0=off, 1=notify, 2=indicate) ***",
        role, handle, subValue);
}

void DualsenseGamepadCallbacks::onStatus(NimBLECharacteristic* pCharacteristic, int code)
{
    ESP_LOGD(LOG_TAG, "DualsenseGamepadCallbacks::onStatus, code: %d", code);
}

DualsenseGamepadDevice::DualsenseGamepadDevice()
    : _config(new DualsenseEdgeControllerDeviceConfiguration())
    , _extra_input(nullptr)
    , _minimalInput(nullptr)
    , _callbacks(nullptr)
    , _calibration(nullptr)
    , _firmwareInfo(nullptr)
    , _pairingInfo(nullptr)
    , _btPatchInfo(nullptr)

{
}

// DualsenseGamepadDevice methods
DualsenseGamepadDevice::DualsenseGamepadDevice(DualsenseGamepadDeviceConfiguration* config)
    : _config(config)
    , _extra_input(nullptr)
    , _minimalInput(nullptr)
    , _callbacks(nullptr)
    , _calibration(nullptr)
    , _firmwareInfo(nullptr)
    , _pairingInfo(nullptr)
    , _btPatchInfo(nullptr)
{
}

DualsenseGamepadDevice::~DualsenseGamepadDevice()
{
    if (getOutput() && _callbacks) {
        getOutput()->setCallbacks(nullptr);
        delete _callbacks;
        _callbacks = nullptr;
    }

    if (_extra_input) {
        delete _extra_input;
        _extra_input = nullptr;
    }
    if (_firmwareInfo) {
        delete _firmwareInfo;
        _firmwareInfo = nullptr;
    }
    if (_calibration) {
        delete _calibration;
        _calibration = nullptr;
    }
    if (_pairingInfo) {
        delete _pairingInfo;
        _pairingInfo = nullptr;
    }

