Mystfit/ESP32-BLE-CompositeHID/DualSenseGamepadDevice.cpp
        if (_config->getAutoReport()) {
            sendGamepadReport();
        }
    }
}
int8_t DualsenseGamepadDevice::touchpadStartTouch(uint16_t x, uint16_t y)
{
    int8_t slotIndex = -1;
    {
        std::lock_guard<std::mutex> lock(_mutex);
        for (int i = 0; i < 2; i++) {
            if (!_touchPointActive[i]) {
                slotIndex = (int8_t)i;
                break;
            }
        }
        if (slotIndex < 0) {
            return -1;
        }

        _touchPointActive[slotIndex] = true;
        _touchPointId[slotIndex] = _nextTouchId;
        _nextTouchId = (_nextTouchId + 1) & 0x7F;

        // Contact byte: bit 7 = 0 (active), bits 0-6 = touch ID
        uint8_t contact = _touchPointId[slotIndex] & 0x7F;
        if (slotIndex == 0) {
            _inputReport.touchpoint_0_contact = contact;
            _inputReport.touchpoint_0_x = x & 0xFFF;
            _inputReport.touchpoint_0_y = y & 0xFFF;
        } else {
            _inputReport.touchpoint_1_contact = contact;
            _inputReport.touchpoint_1_x = x & 0xFFF;
            _inputReport.touchpoint_1_y = y & 0xFFF;
        }
    }

    if (_config->getAutoReport()) {
        sendGamepadReport();
    }

    return slotIndex;
}

void DualsenseGamepadDevice::touchpadUpdatePosition(uint16_t x, uint16_t y, uint8_t touchpointId)
{
    if (touchpointId >= 2) return;

    {
        std::lock_guard<std::mutex> lock(_mutex);
        if (!_touchPointActive[touchpointId]) return;
        if (touchpointId == 0) {
            _inputReport.touchpoint_0_x = x & 0xFFF;
            _inputReport.touchpoint_0_y = y & 0xFFF;
        } else {
            _inputReport.touchpoint_1_x = x & 0xFFF;
            _inputReport.touchpoint_1_y = y & 0xFFF;
        }
    }

    if (_config->getAutoReport()) {
        sendGamepadReport();
    }
}

void DualsenseGamepadDevice::touchpadStopTouch(uint8_t touchpointId)
{
    if (touchpointId >= 2) return;

    {
        std::lock_guard<std::mutex> lock(_mutex);
        if (!_touchPointActive[touchpointId]) return;
        _touchPointActive[touchpointId] = false;
        if (touchpointId == 0) {
            _inputReport.touchpoint_0_contact = 0x80;
        } else {
            _inputReport.touchpoint_1_contact = 0x80;
        }
    }

    if (_config->getAutoReport()) {
        sendGamepadReport();
    }
}

void DualsenseGamepadDevice::release(uint32_t button)
{
    if (isPressed(button)) {
        {
            std::lock_guard<std::mutex> lock(_mutex);
            buttons_clear(_inputReport.buttons, button);
            ESP_LOGD(LOG_TAG, "DualsenseGamepadDevice::release, button: %d", button);
        }

        if (_config->getAutoReport()) {
            sendGamepadReport();
        }
    }
}

bool DualsenseGamepadDevice::isPressed(uint32_t button)
{
    std::lock_guard<std::mutex> lock(_mutex);
    return buttons_test(_inputReport.buttons, button);
}

void DualsenseGamepadDevice::setLeftThumb(int8_t x, int8_t y)
{
    x = constrain(x, DUALSENSE_STICK_MIN, DUALSENSE_STICK_MAX);
    y = constrain(y, DUALSENSE_STICK_MIN, DUALSENSE_STICK_MAX);

    if (_inputReport.x != x || _inputReport.y != y) {
        {
            std::lock_guard<std::mutex> lock(_mutex);
            _inputReport.x = (uint8_t)(x + DUALSENSE_AXIS_CENTER_OFFSET);
            _inputReport.y = (uint8_t)(y + DUALSENSE_AXIS_CENTER_OFFSET);
        }

        if (_config->getAutoReport()) {
            sendGamepadReport();
        }
    }
}

void DualsenseGamepadDevice::setRightThumb(int8_t x, int8_t y)
{
    x = constrain(x, DUALSENSE_STICK_MIN, DUALSENSE_STICK_MAX);
    y = constrain(y, DUALSENSE_STICK_MIN, DUALSENSE_STICK_MAX);

    uint8_t rx = (uint8_t)(x + DUALSENSE_AXIS_CENTER_OFFSET);
    uint8_t ry = (uint8_t)(y + DUALSENSE_AXIS_CENTER_OFFSET);

    if (_inputReport.rx != rx || _inputReport.ry != ry) {
        {
            std::lock_guard<std::mutex> lock(_mutex);
            _inputReport.rx = rx;
            _inputReport.ry = ry;
        }

        if (_config->getAutoReport()) {
            sendGamepadReport();
        }
    }
}

void DualsenseGamepadDevice::setLeftTrigger(uint8_t value)
{
    value = constrain(value, DUALSENSE_TRIGGER_MIN, DUALSENSE_TRIGGER_MAX);

    if (_inputReport.z != value) {
        {
            std::lock_guard<std::mutex> lock(_mutex);
            _inputReport.z = value;
        }

        if (_config->getAutoReport()) {
            sendGamepadReport();
        }
    }
}

void DualsenseGamepadDevice::setRightTrigger(uint8_t value)
{
    value = constrain(value, DUALSENSE_TRIGGER_MIN, DUALSENSE_TRIGGER_MAX);

    if (_inputReport.rz != value) {
        {
            std::lock_guard<std::mutex> lock(_mutex);
            _inputReport.rz = value;
        }

        if (_config->getAutoReport()) {
            sendGamepadReport();
        }
    }
}

void DualsenseGamepadDevice::setGyro(int16_t pitch, int16_t yaw, int16_t roll)
{
    pitch = constrain(pitch, -DUALSENSE_GYRO_RANGE, DUALSENSE_GYRO_RANGE);
    yaw = constrain(yaw, -DUALSENSE_GYRO_RANGE, DUALSENSE_GYRO_RANGE);
    roll = constrain(roll, -DUALSENSE_GYRO_RANGE, DUALSENSE_GYRO_RANGE);

    if (_inputReport.gyro_x != pitch || _inputReport.gyro_y != yaw || _inputReport.gyro_z != roll) {
        {
            std::lock_guard<std::mutex> lock(_mutex);
            _inputReport.gyro_x = pitch;
            _inputReport.gyro_y = yaw;
            _inputReport.gyro_z = roll;
        }

        if (_config->getAutoReport()) {
            sendGamepadReport();
        }
    }
}
void DualsenseGamepadDevice::setAccel(int16_t x, int16_t y, int16_t z)
{
    x = constrain(x, -DUALSENSE_ACC_RANGE, DUALSENSE_ACC_RANGE);
    y = constrain(y, -DUALSENSE_ACC_RANGE, DUALSENSE_ACC_RANGE);
    z = constrain(z, -DUALSENSE_ACC_RANGE, DUALSENSE_ACC_RANGE);

    if (_inputReport.accel_x != x || _inputReport.accel_y != y || _inputReport.accel_z != z) {
        {
            std::lock_guard<std::mutex> lock(_mutex);
            _inputReport.accel_x = x;
            _inputReport.accel_y = y;
            _inputReport.accel_z = z;
        }

