Mystfit/ESP32-BLE-CompositeHID/DualSenseGamepadDevice.cpp
        if (_config->getAutoReport()) {
            sendGamepadReport();
        }
    }
}

void DualsenseGamepadDevice::setBatteryLevel(uint8_t level)
{
    level = constrain(level, DUALSENSE_BATTERY_MIN, DUALSENSE_BATTERY_MAX);
    uint8_t internalLevel = level / 10;  // Convert 0-100 to 0-10

    uint8_t newStatus = (_inputReport.status & 0xF0) | internalLevel;

    if (_inputReport.status != newStatus) {
        {
            std::lock_guard<std::mutex> lock(_mutex);
            _inputReport.status = newStatus;
        }

        if (_config->getAutoReport()) {
            sendGamepadReport();
        }
    }
}

void DualsenseGamepadDevice::setChargingStatus(bool charging)
{
    uint8_t status = charging ? 1 : 0;  // 1 for charging, 0 for discharging

    uint8_t newStatus = (_inputReport.status & 0x0F) | (status << 4);

    if (_inputReport.status != newStatus) {
        {
            std::lock_guard<std::mutex> lock(_mutex);
            _inputReport.status = newStatus;
        }

        if (_config->getAutoReport()) {
            sendGamepadReport();
        }
    }
}

void DualsenseGamepadDevice::setL2TriggerFeedback(uint8_t effectFlags, uint8_t position, uint8_t reserved)
{
    if (_inputReport.l2_trigger_feedback[0] != effectFlags ||
        _inputReport.l2_trigger_feedback[1] != position ||
        _inputReport.l2_trigger_feedback[2] != reserved) {
        {
            std::lock_guard<std::mutex> lock(_mutex);
            _inputReport.l2_trigger_feedback[0] = effectFlags;
            _inputReport.l2_trigger_feedback[1] = position;
            _inputReport.l2_trigger_feedback[2] = reserved;
        }
        if (_config->getAutoReport()) {
            sendGamepadReport();
        }
    }
}

void DualsenseGamepadDevice::setR2TriggerFeedback(uint8_t effectFlags, uint8_t position, uint8_t reserved)
{
    if (_inputReport.r2_trigger_feedback[0] != effectFlags ||
        _inputReport.r2_trigger_feedback[1] != position ||
        _inputReport.r2_trigger_feedback[2] != reserved) {
        {
            std::lock_guard<std::mutex> lock(_mutex);
            _inputReport.r2_trigger_feedback[0] = effectFlags;
            _inputReport.r2_trigger_feedback[1] = position;
            _inputReport.r2_trigger_feedback[2] = reserved;
        }
        if (_config->getAutoReport()) {
            sendGamepadReport();
        }
    }
}

static uint8_t setStatusBit(uint8_t current, uint8_t mask, bool value)
{
    return value ? (current | mask) : (current & ~mask);
}

void DualsenseGamepadDevice::setHeadphonesPlugged(bool plugged)
{
    uint8_t newStatus2 = setStatusBit(_inputReport.status2, DUALSENSE_STATUS2_HEADPHONES_PLUGGED, plugged);
    if (_inputReport.status2 != newStatus2) {
        {
            std::lock_guard<std::mutex> lock(_mutex);
            _inputReport.status2 = newStatus2;
        }
        if (_config->getAutoReport()) {
            sendGamepadReport();
        }
    }
}

void DualsenseGamepadDevice::setHeadphoneMic(bool connected)
{
    uint8_t newStatus2 = setStatusBit(_inputReport.status2, DUALSENSE_STATUS2_HEADPHONE_MIC, connected);
    if (_inputReport.status2 != newStatus2) {
        {
            std::lock_guard<std::mutex> lock(_mutex);
            _inputReport.status2 = newStatus2;
        }
        if (_config->getAutoReport()) {
            sendGamepadReport();
        }
    }
}

void DualsenseGamepadDevice::setMuteActive(bool active)
{
    uint8_t newStatus2 = setStatusBit(_inputReport.status2, DUALSENSE_STATUS2_MUTE_ACTIVE, active);
    if (_inputReport.status2 != newStatus2) {
        {
            std::lock_guard<std::mutex> lock(_mutex);
            _inputReport.status2 = newStatus2;
        }
        if (_config->getAutoReport()) {
            sendGamepadReport();
        }
    }
}

void DualsenseGamepadDevice::setUsbPlugged(bool plugged)
{
    uint8_t newStatus2 = setStatusBit(_inputReport.status2, DUALSENSE_STATUS2_USB_PLUGGED, plugged);
    if (_inputReport.status2 != newStatus2) {
        {
            std::lock_guard<std::mutex> lock(_mutex);
            _inputReport.status2 = newStatus2;
        }
        if (_config->getAutoReport()) {
            sendGamepadReport();
        }
    }
}

void DualsenseGamepadDevice::setTriggers(uint8_t left, uint8_t right)
{
    left = constrain(left, DUALSENSE_TRIGGER_MIN, DUALSENSE_TRIGGER_MAX);
    right = constrain(right, DUALSENSE_TRIGGER_MIN, DUALSENSE_TRIGGER_MAX);

    if (_inputReport.z != left || _inputReport.rz != right) {
        {
            std::lock_guard<std::mutex> lock(_mutex);
            _inputReport.z = left;
            _inputReport.rz = right;
        }
        if (_config->getAutoReport()) {
            sendGamepadReport();
        }
    }
}

void DualsenseGamepadDevice::pressDPadDirection(uint8_t direction)
{

    // Avoid double presses
    if (!isDPadPressed(direction)) {
        ESP_LOGD(LOG_TAG, "Pressing dpad direction %s", dPadDirectionName(direction).c_str());
        {
            std::lock_guard<std::mutex> lock(_mutex);
            hat_set(_inputReport.buttons, direction);
        }

        if (_config->getAutoReport()) {
            sendGamepadReport();
        }
    }
}

void DualsenseGamepadDevice::pressDPadDirectionFlag(DualsenseDpadFlags direction)
{
    // Filter opposite button presses
    if ((direction & (DualsenseDpadFlags::NORTH | DualsenseDpadFlags::SOUTH)) == (DualsenseDpadFlags::NORTH | DualsenseDpadFlags::SOUTH)) {
        ESP_LOGD(LOG_TAG, "Filtering opposite button presses - up down");
        direction = (DualsenseDpadFlags)(direction ^ (uint8_t)(DualsenseDpadFlags::NORTH | DualsenseDpadFlags::SOUTH));
    }
    if ((direction & (DualsenseDpadFlags::EAST | DualsenseDpadFlags::WEST)) == (DualsenseDpadFlags::EAST | DualsenseDpadFlags::WEST)) {
        ESP_LOGD(LOG_TAG, "Filtering opposite button presses - left right");
        direction = (DualsenseDpadFlags)(direction ^ (uint8_t)(DualsenseDpadFlags::EAST | DualsenseDpadFlags::WEST));
    }

    pressDPadDirection(dPadDirectionToValue(direction));
}

void DualsenseGamepadDevice::releaseDPad()
{
    pressDPadDirection(DUALSENSE_BUTTON_DPAD_NONE);
}

bool DualsenseGamepadDevice::isDPadPressed(uint8_t direction)
{
    std::lock_guard<std::mutex> lock(_mutex);
    return hat_get(_inputReport.buttons) == direction;
}

bool DualsenseGamepadDevice::isDPadPressedFlag(DualsenseDpadFlags direction)
{
    std::lock_guard<std::mutex> lock(_mutex);
    uint8_t hat = hat_get(_inputReport.buttons);

